Sovos Bulut e-Fatura WS API v2.2/EK1 - Teknik Belgeler/SOAP/SOAP - getUBLList(OUTBOUND INVOICE).xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ein="http:/fitcons.com/eInvoice/">
   <soapenv:Header/>
   <soapenv:Body>
      <ein:getUBLListRequest>
         <ein:Identifier>urn:mail:defaultgb@fitcons.com</ein:Identifier>
         <ein:VKN_TCKN>1234567801</ein:VKN_TCKN>
         <ein:UUID>F47AC10B-58CC-4372-A567-0E02B2C3D479</ein:UUID>
         <ein:DocType>INVOICE</ein:DocType>
         <ein:Type>OUTBOUND</ein:Type>
      </ein:getUBLListRequest>
   </soapenv:Body>
</soapenv:Envelope>