Sovos_eFatura/EK1 - Teknik Belgeler/SOAP/SOAP - getUBLList(ByDate -INBOUND APP_RESP ENVELOPE).xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ein="http:/fitcons.com/eInvoice/">
   <soapenv:Header/>
   <soapenv:Body>
      <ein:getUBLListRequest>
         <ein:Identifier>urn:mail:defaultgb@fitcons.com</ein:Identifier>
         <ein:VKN_TCKN>1234567801</ein:VKN_TCKN>
         <ein:DocType>ENVELOPE</ein:DocType>
         <ein:Type>INBOUND</ein:Type>
         <ein:FromDate>2015-11-12T00:00:00.000+02:00</ein:FromDate>
         <ein:ToDate>2015-11-13T00:00:00.000+02:00</ein:ToDate>
      </ein:getUBLListRequest>
   </soapenv:Body>
</soapenv:Envelope>